src/Documents/ПоступлениеКоробокДляРазбора/ПоступлениеКоробокДляРазбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКоробокДляРазбора</name>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Коробки</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеКоробокДляРазбора/ManagerModule.bsl
Процедура Чек(ТабДок, Ссылка) Экспорт
   Макет = Документы.ПоступлениеКоробокДляРазбора.ПолучитьМакет("Макет");
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка,
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка.Организатор КАК Организатор,
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка.Количество КАК Количество,
		|	ПоступлениеКоробокДляРазбораКоробки.Коробка.ТочкаНазначения КАК ТочкаНазначения,
		|	1 КАК Коробок,
		|	ПоступлениеКоробокДляРазбораКоробки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеКоробокДляРазбора.Коробки КАК ПоступлениеКоробокДляРазбораКоробки
		|ГДЕ
		|	ПоступлениеКоробокДляРазбораКоробки.Ссылка В(&Ссылки)
		|ИТОГИ
		|	СУММА(Коробок)
		|ПО
		|	Ссылка,
		|	ТочкаНазначения,
		|	Организатор";
	
	Запрос.УстановитьПараметр("Ссылки", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");
	Шапка 						= Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвалТаблицы 		= Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей 	= Макет.ПолучитьОбласть("Детали");
	ОбластьТочкаНазначения 		= Макет.ПолучитьОбласть("ТочкаНазначения");
	ОбластьОрганизатор 			= Макет.ПолучитьОбласть("Организатор");
	
	ТабДок.Вывести(ОбластьЗаголовок);

	

	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
		Шапка.Параметры.НазваниеОрганизации=Константы.СвояТочка.Получить();
		Шапка.Параметры.Дата=Формат(ВыборкаСсылка.Ссылка.Дата,"ДЛФ=ДД");
		Шапка.Параметры.Номер=ВыборкаСсылка.Ссылка.Номер;
		ТабДок.Вывести(Шапка);
		
		ВыборкаТочкаНазначения = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТочкаНазначения.Следующий() Цикл
			
			ОбластьТочкаНазначения.Параметры.Заполнить(ВыборкаТочкаНазначения);
			ТабДок.Вывести(ОбластьТочкаНазначения);
			ВыборкаОрганизатор = ВыборкаТочкаНазначения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОрганизатор.Следующий() Цикл
				ОбластьОрганизатор.Параметры.Заполнить(ВыборкаОрганизатор);
				ТабДок.Вывести(ОбластьОрганизатор);
				ВыборкаДетальныеЗаписи = ВыборкаОрганизатор.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
					ТабДок.Вывести(ОбластьДетальныхЗаписей);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
		ТабДок.Вывести(ОбластьПодвалТаблицы);
		ОбластьПодвал.Параметры.Курьер=ВыборкаСсылка.Ссылка.Курьер;
		ОбластьПодвал.Параметры.Итого=ВыборкаСсылка.Коробок ;
		ТабДок.Вывести(ОбластьПодвал);
		
	КонецЦикла;


//	ТабДок.Очистить();
	
	
//	Шапка.Параметры.НазваниеОрганизации=Константы.НазваниеОрганизации.Получить();
//	Шапка.Параметры.Тел=Константы.Телефоны.Получить();


	//ТабДок.ЗакончитьАвтогруппировкуСтрок();

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
